src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДР</name>
      <description>ДР</description>
    </items>
    <items>
      <name>КнигиДекады</name>
      <description>Книги декады</description>
    </items>
    <items>
      <name>Лекция</name>
      <description>Лекция</description>
    </items>
    <items>
      <name>ОпросАтеней</name>
      <description>Опрос Атеней</description>
    </items>
    <items>
      <name>РК_Рамка</name>
      <description>РК: Рамка</description>
    </items>
    <items>
      <name>РК_Фон</name>
      <description>РК: Фон</description>
    </items>
    <items>
      <name>Термин</name>
      <description>Термин</description>
    </items>
  </predefined>
  <attributes>
    <name>Файл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/МетодыОбработкиИзображений/Module.bsl
Функция ОбработатьКартинкуПоШаблону(Знач ВидОбработки, Знач СтруктураОбработки, Знач ВозвращатьДД = Ложь) Экспорт
	
	НаименованиеВида = ВидОбработки.Наименование;
	
	ТекстА = СтруктураОбработки["ТекстА"];
	ТекстБ = СтруктураОбработки["ТекстБ"];
	ТекстВ = СтруктураОбработки["ТекстВ"];
	
	Путь 	= ПолучитьИмяВременногоФайла("png");
	
	Если ТипЗнч(СтруктураОбработки["Медиа"]) = Тип("СправочникСсылка.Файлы") Тогда
		ОбъектМедиа = СтруктураОбработки["Медиа"].ПолучитьОбъект();
		ДД			= ОбъектМедиа.Файл.Получить();
	Иначе
		ДД		= СтруктураОбработки["МедиаДД"];
	КонецЕсли;
	
	ДД.Записать(Путь);
	
	Если НаименованиеВида = "Заголовок притчи" Тогда
		Метод_ЗаголовокПритчи(ТекстА, ТекстБ, Путь);
		
	ИначеЕсли НаименованиеВида = "Основной текст притчи" Тогда
		Метод_ОсновнойТекстПритчи(ТекстА, Путь);		
	КонецЕсли;
	
	Если ВозвращатьДД Тогда
		ДД 	= Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
		Возврат ДД;
	Иначе     
		Возврат Путь;
	КонецЕсли;
	
КонецФункции

Процедура Метод_ЗаголовокПритчи(Знач ТекстА, Знач ТекстБ, Знач Путь) 
	
	
	РазмерЗаголовка			= 74;
	РазмерШрифта         	= 35;
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ Путь 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -gravity Center -fill white -font Sylfaen  -annotate +0+50 '" 
	+ ТекстА 
	+"' "
	+ Путь
	+ Символы.ПС
	+"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill gray -font Tahoma -annotate +0+250 '"
	+ ТекстБ
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры

Процедура Метод_ОсновнойТекстПритчи(Знач ТекстА, Знач Путь);

	РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 54;
	
	Текст = СтрЗаменить(ТекстА, "¶", " \n ");
	Текст = СтрЗаменить(Текст, Символы.ПС, " \n ");
	Текст = СтрРазделить(Текст, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		Если Текст[Н] = "\n" Тогда
			ТекстСтрокой = ТекстСтрокой + Текст[Н];
			ЧастьТекста = "";
			Продолжить;
		КонецЕсли;
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill white -font Tahoma -annotate +0+0 '"
	+ ТекстСтрокой
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры



Функция СформироватьГалерею(Знач Картинка) Экспорт
	
	Если ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
		
		ВходнаяКартинка = ПолучитьИмяВременногоФайла("jpeg");
		Картинка.Записать(ВходнаяКартинка);
		Картинка = ВходнаяКартинка;
		
	КонецЕсли;
	
	МассивКартинок 		= Новый Массив;
	ОснованяКартинка 	= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка			= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка1 		= СтрЗаменить(ДопКартинка, ".jpg", "-0.jpg");
	ДопКартинка2 		= СтрЗаменить(ДопКартинка, ".jpg", "-1.jpg");
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	"convert -resize 768x1152 """ + Картинка + """ """ + ОснованяКартинка + """" + Символы.ПС + 
	"convert -gravity Center -crop ""91%"" """ + ОснованяКартинка + """ """ + ОснованяКартинка + """" + Символы.ПС +  
	"convert -crop 768x768 """ + ОснованяКартинка + """ """ + ДопКартинка + """" 
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ОснованяКартинка));
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ДопКартинка1));
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ДопКартинка2));
	
	УдалитьФайлы(ИмяСкрипта);
	Возврат МассивКартинок; 
	
КонецФункции

Функция СформироватьТермин(Знач Термин) Экспорт
	
	РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 64;
	
	ОбъектТермин			= Справочники.Файлы.Термин.ПолучитьОбъект();
	Фон						= ОбъектТермин.Файл.Получить();
	ПутьФон					= ПолучитьИмяВременногоФайла("png");
	КартинкаОбработанная	= ПолучитьИмяВременногоФайла("png");
	Фон.Записать(ПутьФон);
	
	Текст = СтрРазделить(Термин.Описание, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ ПутьФон 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -fill white -font Sylfaen  -annotate +90+180 '" 
	+ Термин.Наименование 
	+"' "
	+ КартинкаОбработанная
	+ Символы.ПС
	+ "magick "
	+ КартинкаОбработанная
	+ " -pointsize "
	+ РазмерШрифта
	+" -fill white -font Tahoma -annotate +90+320 '"
	+ ТекстСтрокой
	+ "' "
	+ КартинкаОбработанная
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
	Путь 					= КартинкаОбработанная;
	КартинкаОбработанная 	= Новый ДвоичныеДанные(Путь);
	УдалитьФайлы(Путь);
	
	
	Возврат КартинкаОбработанная;
	
КонецФункции

Функция СформироватьСобытие(Знач Событие, Знач Сообщество) Экспорт
		
	ЦветПодложки 	= "black";
	ЦветТекста 		= "white";
	Шрифт			= "Sylfaen";
	
	КартинкаОбработанная = ПолучитьИмяВременногоФайла(".png");

	Место			= Событие.Место;
	Наименование 	= Событие.Аннотация;
	ДатаСобытия		= Событие.Дата;
	
	ЛогоДД 	= Сообщество.ПолучитьОбъект().Лого.Получить();
	Лого	= ПолучитьИмяВременногоФайла(".png");
	ЛогоДД.Записать(Лого);

	ФотоДД 	= Событие.ПолучитьОбъект().КартинкаДД.Получить();
	Фото	= ПолучитьИмяВременногоФайла(".png");
	ФотоДД.Записать(Фото);
	
	Переносы = СтрРазделить(Событие.Аннотация, "\n").ВГраница();

	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"convert -resize 96x96 """
	+ Лого
	+ """ """ 
	+ Лого
	+ """"
	+ Символы.ПС
	+ "magick """
	+ Фото
	+ """ """ 
	+ Лого
	+ """ -gravity SouthWest -geometry +15+"
	+ Строка(Событие.ОтступМарки)
	+ " -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font " + Шрифт + " -pointsize 28 -gravity SouthWest -draw ""text 130,65 '"
	+ Наименование 
	+ "'"" """ 
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font Tahoma -pointsize 18 -gravity SouthWest -draw ""text 130,30 '"
	+ Место
	+ ", "
	+ ДатаСобытия
	+ "'"" """
	+ КартинкаОбработанная
	+ """"
	
	
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);

	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
	
	Путь 					= КартинкаОбработанная;
	КартинкаОбработанная 	= Новый ДвоичныеДанные(Путь);
	УдалитьФайлы(Путь);

	
	Возврат КартинкаОбработанная;

КонецФункции
